package ru.mobile.art.mobileArtBackend.model.testData

import ru.mobile.art.mobileArtBackend.model.entities.NewsInfo
import ru.mobile.art.mobileArtBackend.model.news.NewsCategory
import ru.mobile.art.mobileArtBackend.model.news.NewsHeading

val music1 = NewsInfo(
    heading = NewsHeading.interview,
    category = NewsCategory.music,
    title = "Константин Волостнов",
    shortText = "Российский органист, пианист и клавесинист\n " +
            "\n- У Вас немало наград престижных конкурсов и фестивалей. Какое конкурсное выступление Вам заполнилось больше всего \n" +
            "\n— Мне трудно выделить выступление на каком-то отдельном конкурсе. Конечно, успешное выступление в Англии на старейшем и сложнейшем конкурсе в " +
            "мире — это несравнимые впечатления. Грандиозный собор в Сэнт-Олбанс, в котором проходили прослушивания, — это потрясающее место само по себе! С другой стороны," +
            " игра с оркестром и превосходным дирижёром, профессором Анатолием Абрамовичем Левиным на конкурсе имени А.Ф. Гедике в Москве — незабываемый и удивительно светлый опыт. При этом конкурс на юге Германии в городе Шрамберге," +
            " целиком в своих трёх турах посвящённый немецкой романтической музыке для органа, также совершенно иное пространство впечатлений, заставивших меня задуматься об определённых параллелях в русском и немецком музыкальном миропонимании. Неслучайно же Чайковский настолько уважал композиторское наследие Германии и во многом на него ориентировался.",
    content = "<html><body><h1>News</h1></body></html>",
    newsThumbnail = "https://static.tildacdn.com/tild6639-6232-4264-a262-656661376431/IMG_5095.jpg"
)

val music2 = NewsInfo(
    heading = NewsHeading.interview,
    category = NewsCategory.music,
    title = "Марина Агафонова",
    shortText = "Оперная и концертно-камерная певица,\n" +
            "лауреат международных конкурсов, лауреат премии Верди Зальцбургского Фестиваля, солистка\n" +
            "Москонцерта, эксперт в области вокальной музыки, автор концертных программ и детских\n" +
            "познавательных абонементов \n — Одними из ваших популярных проектов стали познавательные интерактивные спектакли, ориентированные на детскую аудиторию. Как возникла такая идея \n" +
            "\n— Когда у меня родился ребенок, я задумалась о том, как познакомить его с миром классической музыки и оперным искусством так, чтобы ему было интересно и увлекательно. Тогда у меня появилась идея совместно с Домом музыки сделать детские познавательные программы, которые я назвала «Композиторы – детям». ",
    content = "<html><body><h1>News</h1></body></html>",
    newsThumbnail = "https://static.tildacdn.com/tild6438-3236-4165-a362-613232386232/___.jpg"
)

val music3 = NewsInfo(
    heading = NewsHeading.interestingFacts,
    category = NewsCategory.music,
    title = "Детская музыкальная школа имени И.О. Дунаевского",
    shortText = "Детская музыкальная школа имени И.О. Дунаевского",
    content = "<html><body><h1>News</h1></body></html>",
    newsThumbnail = "https://sun9-46.userapi.com/impg/Ytedi5CV70qT0Z4A8og9KjnHtPLRrVzKE763gQ/wetQKTbp4PQ.jpg?size=1852x1852&quality=95&sign=8d281796d50c69c5b0e0f6c1aafd8597&type=album"
)

val music4 = NewsInfo(
    heading = NewsHeading.interestingFacts,
    category = NewsCategory.music,
    title = "Детская музыкальная школа имени С.В. Рахманинова",
    shortText = "Школа была занесена в Книгу трудовой славы. \n " +
            "18 лет в школе существует комната-музей Сергей Рахманинова. " +
            "\n Более 380 выпускников школы стали профессиональными музыкантами, восемь преподавателей школы — ее бывшие ученики",
    content = "<html><body><h1>News</h1></body></html>",
    newsThumbnail = "https://sun9-62.userapi.com/impg/wK9_h-7c5Nr8LFrmqA0CrLjzhVZEUcoGxorM0g/CMLonvwVqlo.jpg?size=1624x1624&quality=95&sign=0cf917cecc9a11683cf3986a4e7394a0&type=album"
)

val art1 = NewsInfo(
    heading = NewsHeading.interestingFacts,
    category = NewsCategory.art,
    title = "Детская школа искусств имени Д.С. Бортнянского",
    shortText = "В 2021-2022 учебном году Детская школа искусств имени Д.С.Бортнянского отмечает 50-летний юбилей!\n" +
            "\nДом, в котором расположена школа, построен архитектором немецкого происхождения Максимом Геппенером для купца и мецената Федора Наживина в 1874 году.\n" +
            "\nВ 2007 году школе присвоено имя Дмитрия Степановича Бортнянского – автора русской духовной музыки, выдающегося композитора конца XVIII – начала XIX века. В 2009 году в школе открыта мемориальная комната, посвященная жизни и творчеству музыканта.\n" +
            "\nВ школе обучаются более 350 детей по музыкально-инструментальному, вокально-хоровому и художественному направлению. С 2018 года реализуется образовательная программа творческого инклюзивного образования «Играю, рисую, пою».\n" +
            "\n19 апреля 2022 года в Московском международном Доме музыки состоится юбилейный концерт.\n",
    content = "<html><body><h1>News</h1></body></html>",
    newsThumbnail = "https://sun9-40.userapi.com/impg/6G9jR3cd8Jm2T8tbKHB_Fo_G9bKNYI6QBpS-Bw/SBjP44Q0l4k.jpg?size=1852x1852&quality=95&sign=ce1a0a31a335308abe4e40fa30940c4f&type=album"
)

val art2 = NewsInfo(
    heading = NewsHeading.interestingFacts,
    category = NewsCategory.art,
    title = "Детская художественная школа имени М.А. Врубеля",
    shortText = "В 2021 году исполнилось 165 лет со дня рождения Михаила Александровича Врубеля и 40 лет со дня основания Детской художественной школе имени М.А. Врубеля!\n" +
            "\nВ школе обучаются 690 детей по специальностям батик (художественная обработка ткани), керамика, скульптура и графика.",
    content = "<html><body><h1>News</h1></body></html>",
    newsThumbnail = "https://sun9-43.userapi.com/impg/HJCS8LM5KYIfgbJHfK6jTBPv4eEIilwXfrpvGA/-lNFOL-qpmE.jpg?size=1440x1440&quality=96&sign=85b2aa3e5b3fd0a5214c07e6a4c9bfbb&type=album"
)

val art3 = NewsInfo(
    heading = NewsHeading.famousPeople,
    category = NewsCategory.art,
    title = "Вольфганг Амадей Моцарт",
    shortText = "27 января родился один из самых популярных классических композиторов – Вольфганг Амадей Моцарт! \n" +
            "\nЗа свою жизнь Моцарт написал более 600 произведений. В отличие от многих композиторов XVIII века, он не просто работал во всех музыкальных формах своего времени, но и добился в них большого успеха. Почти все сочинения Моцарта признаны шедеврами симфонической, концертной, камерной, оперной и хоровой музыки.\n" +
            "\nВ 2002 году Детской музыкальной школе\n№ 102 было присвоено имя знаменитого композитора, и теперь в Таганском районе дети учатся в Детской музыкальной школе имени Вольфганга Амадея Моцарта.",
    content = "<html><body><h1>News</h1></body></html>",
    newsThumbnail = "https://sun9-38.userapi.com/impg/Ao0Rzs2ANKoFyJlrHdot-TxiwtzM2CT2XdnoIg/dFLLyzp63gw.jpg?size=1440x1440&quality=96&sign=d6d045250d6aa3d5f6555a03ab6bef06&type=album"
)

val art4 = NewsInfo(
    heading = NewsHeading.famousPeople,
    category = NewsCategory.art,
    title = "Интересные профессии",
    shortText = "«Чародей гитары». В этом году исполняется 110 лет со дня рождения Александра Михайловича Иванова-Крамского!\n" +
            "\nЕго имя хорошо известно не только гитаристам нашей страны, но и зарубежным гитаристам, играющим его произведения на сценических площадках мира. Репертуар Иванова-Крамского включал в себя классические произведения зарубежных композиторов, его собственные произведения, обработки русских народных песен, а также пьесы советских композиторов, начавших писать для гитары.\n" +
            "\nВ Москве для юных музыкантов открыта Детская музыкальная школа имени А.М.Иванова-Крамского, названная в честь знаменитого музыканта. В прошлом году школа отметила 50-летний юбилей. В ней обучается 800 учеников по направлениям: фортепиано, хоровое пение, струнные инструменты, духовые и ударные инструменты, народные инструменты, сольное пение",
    content = "<html><body><h1>News</h1></body></html>",
    newsThumbnail = "https://sun9-77.userapi.com/impg/MKt5Ia77LGaiiQYK7-NetlaiohT9TY-YgUoSKw/y6xmKdWuxiA.jpg?size=1624x1624&quality=95&sign=898a2e078a8ce52f85a9a3daed25521b&type=album"
)

val art5 = NewsInfo(
    heading = NewsHeading.interestingFacts,
    category = NewsCategory.art,
    title = "Детская художественная школа «Бабенская игрушка»",
    shortText = "Детская художественная школа «Бабенская игрушка» в 2021 году празднует 20-летний юбилей!\n" +
            "\nШкола была открыта в 2001 году с целью сохранения и возрождения знаменитой в России Бабенской деревянной токарно-полированной игрушки.\n" +
            "\n8 декабря школу придут поздравить коллеги и деятели культуры. К юбилею она подготовила для приглашенных гостей праздничный концерт и экскурсию по школе и музею «Дом токаря».",
    content = "<html><body><h1>News</h1></body></html>",
    newsThumbnail = "https://sun9-32.userapi.com/impg/KCTn2jpZh7j6Q36n5rfwVapEqduKhGaM55OMpg/IvQfWb0TXW8.jpg?size=2160x2160&quality=96&sign=406758f97b2093d91901431b814c4df3&type=album"
)

val threatere1 = NewsInfo(
    heading = NewsHeading.interestingFacts,
    category = NewsCategory.theater,
    title = "Театр — это такая кафедра, с которой можно много сказать миру добра",
    shortText = "На сцене театра Et Cetera юные актеры московских школ искусств продемонстрировали свое мастерство в рамках III тура грантов Мэра Москвы в сфере культуры и искусства. \n\n" +
            "В состав жюри вошли известные артисты театра и кино:\n\n" +
            "Анна Леонидовна Большова — заслуженная артистка Российской Федерации, российская актриса театра, кино и дубляжа, почетный деятель искусств Москвы. \n\n" +
            "Виктор Викторович Раков — народный артист Российской Федерации, советский и российский актер театра, кино, озвучивания и дубляжа, певец. \n\n" +
            "Игорь Владимирович Яцко — заслуженный артист Российской Федерации, художественный руководитель режиссерско-актерской лаборатории, российский актер театра и кино, театральный режиссер",
    content = "<html><body><h1>News</h1></body></html>",
    newsThumbnail = "https://sun9-61.userapi.com/impg/Q8GoOTR39AQrRYsTRrV8Tsx38p6wm8BKw2IN8g/e_mLXHUUXH8.jpg?size=2000x1333&quality=95&sign=513dfe2048df1c39bc5bed2d73d59077&type=album",
)

val threatere2 = NewsInfo(
    heading = NewsHeading.interestingFacts,
    category = NewsCategory.theater,
    title = "Лучшие исполнительницы роли Кармен",
    shortText = "Знаменитая опера Бизе «Кармен» сделала образ испанской цыганки одним из самых популярных и цитируемых в мировом искусстве. На сценах оперных театров роль исполняли самые знаменитые артистки, каждый раз соревнуясь за звание «Лучшей Кармен мира». \n\n" +
            "«Кармен — единственная опера, которую я не пою, а которая поёт мною», — утверждала Елена Образцова. Образ настолько захватывал певицу, что она не раз называла эту свою роль самой любимой. \n\n" +
            "Кармен в исполнении Ирины Архиповой была «царственной и величественной». Блестящая певческая техника певицы дополняла образ особенной драматичностью. \n\n" +
            "В конце 60-х годов в Париже состоялся европейский дебют Тамары Синявской. Певица говорила, что именно столица Франции дала ей путевку в оперу. В газетах тогда написали, что она с «редкой музыкальностью и большим чувством» исполнила арии «Кармен» и назвали эту работу артистки «поистине великим искусством». \n\n" +
            "Образ Кармен захватил и балетную сцену – композитор Родион Щедрин сделал специальное оркестровое переложение для балета, а ведущую партию исполнила Майя Плисецкая. Это один из самых ярких образов, созданных балериной.",
    content = "<html><body><h1>News</h1></body></html>",
    newsThumbnail = "https://sun9-8.userapi.com/impg/_BXwDHjFYBl6jQ_Kt7El9e-Wb88rKNFE-gCYSA/KPFv7BPxf54.jpg?size=2559x2559&quality=95&sign=622208d88d28cc7f9a7b4bec9728af71&type=album",
)

val threatere3 = NewsInfo(
    heading = NewsHeading.interview,
    category = NewsCategory.theater,
    title = "Екатерина Ганелина",
    shortText = "Известный российский концертмейстер, постоянный концертмейстер народной артистки России Хиблы Герзмава \n" +
            "\n — Кто был вашим ориентиром в профессии \n\n" +
            "— Главным ориентиром для меня стала мама — Арефьева Евгения Михайловна. Она была ведущим концертмейстером Свердловского оперного театра, активно концертировала, преподавала. Ее увлеченность профессией, самоотдача и успехи в достижении целей поражают. И сейчас, будучи профессором Московской консерватории, мама продолжает совмещать преподавание с работой в театре. Я практически выросла за кулисами, любовь к опере и вокальной музыке у меня — с детства.",
    content = "<html><body><h1>News</h1></body></html>",
    newsThumbnail = "https://static.tildacdn.com/tild6466-3437-4265-a531-386562376335/DSCF0696.jpg",
)

val threatere4 = NewsInfo(
    heading = NewsHeading.interview,
    category = NewsCategory.theater,
    title = "Мария Холкина",
    shortText = "Руководитель сектора развития рекламных и информационных технологий Московской филармонии, создательница просветительского проекта о классической музыке Muzium \n — Что вас побудило создать проект Muzium \n\n" +
            "— Переехав из Сибири в Москву и поработав на разных телепроектах, я попала в\n" +
            "главную концертную организацию страны, Московскую филармонию. Я чувствовала, что это мой мир, мое призвание — но при этом не могла ответить на самые простые, базовые вопросы о классической музыке. Это меня тревожило, роняло самооценку, я не принимала серьезное участие в развитии ключевых проектов. Мне хотелось получить какую-то систему координат в музыкальной истории и теории, при этом не обучаясь несколько лет в музыкальном вузе.\n" +
            "В тот момент не существовало курсов, видеоблогов и других форматов о классической музыке, которые сейчас цветут пышным цветом. И я решила сделать собственный проект.",
    content = "<html><body><h1>News</h1></body></html>",
    newsThumbnail = "https://static.tildacdn.com/tild3962-3539-4062-b663-323635396432/noroot.png",
)

val choreography1 = NewsInfo(
    heading = NewsHeading.interestingFacts,
    category = NewsCategory.choreography,
    title = "Детская школа искусств «Тутти»",
    shortText = "В 2022 году Детская школа искусств «Тутти» отмечает 30 лет!\n" +
            "\nИдея назвать школу «Тутти» принадлежит директору школы Литвиненко Нине Рудольфовне. Музыкальный термин «tutti» в переводе с итальянского означает «вместе». Это и есть главный принцип обучения в школе, где дети, преподаватели и родители – дружный, живущий яркой творческой жизнью коллектив.\n" +
            "\nВ школе обучаются 1260 детей по музыкально-инструментальному, эстрадно-джазовому, вокально-хоровому, хореографическому и художественному направлениям. А с 2018 г. реализуется образовательная программа творческого инклюзивного образования «Мир искусств» для детей с расстройствами аутистического спектра.\n" +
            "\n1 апреля 2022 г. в Культурном центре «Москворечье» состоится юбилейный концерт «Я ВЫБИРАЮ «ТУТТИ».",
    content = "<html><body><h1>News</h1></body></html>",
    newsThumbnail = "https://sun9-38.userapi.com/impg/tPSKt3cw4i09APPDfxXBaxMH3dQAg2UimNcC_w/oPaSCPAdxro.jpg?size=1852x1852&quality=95&sign=4645d51e8af6df4a7faefcb048c37aef&type=album",
)

val choreography2 = NewsInfo(
    heading = NewsHeading.interestingFacts,
    category = NewsCategory.choreography,
    title = "Детская школа искусств «Центр»",
    shortText = "Мы продолжаем знакомить вас с московскими школами искусств, внимательно изучая творческую жизнь и проникаясь духом каждой из них. Сегодня мы совершим путешествие по лучшей школе искусств 2017 года - Детской школе искусств «Центр»\n" +
            "\nПолувековая история «Центра» – это путь от районного Дома пионеров до Детской школы искусств. Сегодня она представляет собой настоящий центр культуры и искусств, где занимается более 2,5 тысяч детей. В «Центре» создана многоступенчатая система развития одаренности и творческих способностей учащихся. Среди направлений – визуальные искусства, музыкально-инструментальное исполнительство, хореографическое творчество, вокально-хоровое искусство, разностороннее развитие.\n" +
            "\nВ прошлом году школа была отремонтирована по программе Мэра Москвы «Искусство-детям», и сегодня каждый, кто попадает в школу, оказывается в красочном мире детского творчества: территория вокруг привлекает современным ландшафтным дизайном, детскими игровыми площадками со скульптурами героев сказок. Холл первого этажа, лестницы и галереи образуют особое выставочное пространство, где можно увидеть художественные работы учащихся. Прекрасно оборудованы кабинеты хореографии, вокального искусства, музыкальные классы, художественные мастерские, компьютерные классы, соответствующие всем современным техническим требованиям, а все учащиеся теперь занимаются на новых музыкальных инструментах.",
    content = "<html><body><h1>News</h1></body></html>",
    newsThumbnail = "https://sun9-7.userapi.com/impg/y1jpV0f5KhTV6EIX8_wf7-CITGLnaJue23cpVw/2ELPqJ2Z964.jpg?size=1280x853&quality=96&sign=e7537fe6f56151ef7d61906cf8df41f5&type=album",
)

val choreography3 = NewsInfo(
    heading = NewsHeading.interestingFacts,
    category = NewsCategory.choreography,
    title = "Талант и грация",
    shortText = "B Москве пройдет уникальный концерт учеников столичного хореографического училища и донецкой балетной школы!\n" +
            "\nВ 2023 году Московское государственное хореографическое училище имени Л.М. Лавровского отмечает свой тридцатилетний юбилей. В честь этого события 25 мая в 19:00 состоится грандиозный отчетный концерт в Московском государственном академическом театре «Русская песня», приглашенными гостями которого станут деятели хореографического искусства Донецка. Концерт «Дивертисмент: Эпизод 1» состоит из номеров, поставленных в классической, народной и современной хореографии. ",
    content = "<html><body><h1>News</h1></body></html>",
    newsThumbnail = "https://sun9-19.userapi.com/impg/DQL1cpcAUr1ZF3BhrUoLEqTHRIjDjxO6xA4XBA/4TxfZz07wmQ.jpg?size=2559x2559&quality=95&sign=018be3a34b69b168146249fe5aef2d26&type=album",
)

val allTestNews = listOf(
    music1, music2, music3, music4,
    art1, art2, art3, art4, art5,
    threatere1, threatere2, threatere3, threatere4,
    choreography1, choreography2, choreography3
)
